In [1]:
!pip install pandas

Requirement already satisfied: pandas in c:\users\dell\anaconda3\lib\site-packages (1.0.5)
Requirement already satisfied: pytz>=2017.2 in c:\users\dell\anaconda3\lib\site-packages (from pandas) (2020.1)
Requirement already satisfied: python-dateutil>=2.6.1 in c:\users\dell\anaconda3\lib\site-packages (from pandas) (2.8.1)
Requirement already satisfied: numpy>=1.13.3 in c:\users\dell\anaconda3\lib\site-packages (from pandas) (1.18.5)
Requirement already satisfied: six>=1.5 in c:\users\dell\anaconda3\lib\site-packages (from python-dateutil>=2.6.1->pandas) (1.15.0)

In [7]:
# import the pandas lib
import pandas as pd
df = pd.DataFrame({"So_No":[1,2,3,4,5] ,"name":['Srikar',"falam","Anjan","Sathish","Raj"]})
df

   So_No     name
0      1   Srikar
1      2    falam
2      3    Anjan
3      4  Sathish
4      5      Raj

In [5]:
# import the pandas lib
import pandas as pd
df = pd.DataFrame({"So_No":[1,2,3,4,5] ,"name":['Srikar',"falam","Anjan","Sathish","Raj"]})
# exporting the dataframe into different sourses
df.to_csv("dataframe.csv")
df.to_json("dataframe.json")

In [6]:
# import the pandas lib
import pandas as pd
# import the data sourse 
df = pd.read_csv("dataframe.csv")
df

   Unnamed: 0  So_No     name
0           0      1   Srikar
1           1      2    falam
2           2      3    Anjan
3           3      4  Sathish
4           4      5      Raj

In [9]:
df = pd.DataFrame({"Name": ["Braund, Mr. Owen Harris","Allen, Mr. William Henry","Bonnell, Miss. Elizabeth"],
                         "Age": [22, 35, 58],
                         "Sex": ["male", "male", "female"]})
df

                       Name  Age     Sex
0   Braund, Mr. Owen Harris   22    male
1  Allen, Mr. William Henry   35    male
2  Bonnell, Miss. Elizabeth   58  female

In [11]:
df['Age']

0    22
1    35
2    58
Name: Age, dtype: int64

In [12]:
ages = pd.Series([22, 35, 58], name="Age")
ages

0    22
1    35
2    58
Name: Age, dtype: int64

In [13]:
df['Age'].max()

58

In [14]:
ages.max()

58

In [15]:
df

                       Name  Age     Sex
0   Braund, Mr. Owen Harris   22    male
1  Allen, Mr. William Henry   35    male
2  Bonnell, Miss. Elizabeth   58  female

In [16]:
df.describe()

             Age
count   3.000000
mean   38.333333
std    18.230012
min    22.000000
25%    28.500000
50%    35.000000
75%    46.500000
max    58.000000

In [17]:
df.head()  # first 5 records

                       Name  Age     Sex
0   Braund, Mr. Owen Harris   22    male
1  Allen, Mr. William Henry   35    male
2  Bonnell, Miss. Elizabeth   58  female

In [18]:
df.head(1)

                      Name  Age   Sex
0  Braund, Mr. Owen Harris   22  male

In [19]:
df.tail()

                       Name  Age     Sex
0   Braund, Mr. Owen Harris   22    male
1  Allen, Mr. William Henry   35    male
2  Bonnell, Miss. Elizabeth   58  female

In [20]:
df.tail(1)

                       Name  Age     Sex
2  Bonnell, Miss. Elizabeth   58  female

In [22]:
df.dtypes

Name    object
Age      int64
Sex     object
dtype: object